#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=absolutely-helped-monkfish]
random_password.master: Refreshing state... [id=none]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a28d56b4354e1555]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
data.aws_ami.latest_amazon_linux: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_availability_zones.available: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue_dead_letter]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-role]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|3682813B-FD26-444E-9A4A-059E260A3BB7]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1909623485]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-role-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-role-20240111182508327600000001]
data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-05c89af705fc8fb3c]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=c9ba8237-858e-455f-9381-e5622914639c]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond]
data.aws_secretsmanager_secret_version.password: Reading...
data.aws_secretsmanager_secret_version.password: Read complete after 1s [id=arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond|AWSCURRENT]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-034fb73568e35a2ad]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06f715bf935e801cd]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0634c8e7fd10a8009]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbf6497c54be8733]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0aa60a64fc5b1a696]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-0021f9c618a3119d0]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02d7c67035e5124fa]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cea1fda906409973]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0c8d408915a011b41]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-027947bcf325829ac]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0559b61f5a74fcac2]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-035759611c538ce80]
aws_security_group.lambda_ingestion_sg: Refreshing state... [id=sg-056eb17c17ad555ff]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-027947bcf325829ac1080289494]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0a64fd872d6491e97]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bcce440882e2dc3f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fb53b1aed3271b31]
aws_instance.jumpbox: Refreshing state... [id=i-03a61c51dc0c480c7]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-05a85d90c903644d5]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0b0356ee59303c51f]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-073098b78e8aa32b6]
aws_security_group.sm_sg: Refreshing state... [id=sg-0d150a18aaa621a04]
aws_security_group.database_sg: Refreshing state... [id=sg-07425be98e514225f]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1721867553]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-022eb3a6d85fa06a7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0327b452f427d62fc]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage]
aws_db_instance.vector_db: Refreshing state... [id=db-YISND6N7BEMRMBM6WIYBKS3WJA]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1722092503]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2773187410]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-role-20240111183932540100000001]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group.lambda_inference_sg will be created
  + resource "aws_security_group" "lambda_inference_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Lambda Inference"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "lambda-inference-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0a28d56b4354e1555"
    }

  # module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-inference"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
    }

  # module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-inference-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "accessnetworkinterface"
                    },
                  + {
                      + Action   = "bedrock:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "bedrockusage"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "loggroup"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-inference/*:*"
                      + Sid      = "logwrite"
                    },
                  + {
                      + Action   = [
                          + "rds-db:rollback-transaction",
                          + "rds-db:execute-statement",
                          + "rds-db:connect",
                          + "rds-db:commit-transaction",
                          + "rds-db:beginTransaction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:rds:us-west-2:446872271111:db:vector_db"
                      + Sid      = "rdsconnectreadwrite"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-2:446872271111:secret:vectordb-password-main-absolutely-helped-monkfish-hyaond"
                      + Sid      = "secretsmanager"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
    }

  # module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-inference-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
    }

  # module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-inference-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-inference-role"
    }

  # module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-inference-role"
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-inference"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-west-2.amazonaws.com/ingestion-lambda-ecr:a381ad81b6f2cecb33fde8c93f7da6713ca516940dc3061ac2a918b41a399ff6"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "Project"     = "levio-aws-demo-fev"
          + "Terraform"   = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PGVECTOR_DATABASE"             = "vector_db"
              + "PGVECTOR_DRIVER"               = "psycopg2"
              + "PGVECTOR_HOST"                 = "vector-db.cyxgx8pmxirg.us-west-2.rds.amazonaws.com"
              + "PGVECTOR_PASSWORD_SECRET_NAME" = "vectordb-password-main-absolutely-helped-monkfish"
              + "PGVECTOR_PORT"                 = "5432"
              + "PGVECTOR_USER"                 = "postgres_admin"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-0bbf6497c54be8733",
              + "subnet-0cea1fda906409973",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion"
      ~ image_uri                      = "446872271111.dkr.ecr.us-west-2.amazonaws.com/ingestion-lambda-ecr:7a40510eb9274bf862d65528c9ca9d00a56ce349b4829666d2cf91116d363d26" -> "446872271111.dkr.ecr.us-west-2.amazonaws.com/ingestion-lambda-ecr:a381ad81b6f2cecb33fde8c93f7da6713ca516940dc3061ac2a918b41a399ff6"
      ~ last_modified                  = "2024-01-13T02:06:44.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Infrastructure planning and management`*